Conf.Simple/src/Catalogs/SUI_НастройкиДокументовОбмена/SUI_НастройкиДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SUI_НастройкиДокументовОбмена</name>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяМетаданныхДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СинонимМетаданныхДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьДокументОбменаПриЗаписиДокумента1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеПоУмолчанию</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрупповоеСканирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьВДокумент1СПослеОбмена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекОтбораДокументов</name>
    <comment>Настройки компоновки данных содержащие элементы отбора</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекРеквизитовДокумента</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПередЗаписью</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПослеЗаписи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиТаблиц</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПропускатьНеЗаполненные</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ХранилищеНастроекРеквизитовТаблицы</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>АлгоритмОбработкиСтрокЗагрузкиДанных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПостобработкаЗаполнениеРеквизитов</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПостобработкаСозданиеДокументовНаОсновании</name>
    <attributes>
      <name>ИмяДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеПриЗаписи</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>АлгоритмОбработчик</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиИдентификацииСтрок</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Conf.Simple/src/Enums/SUI_ТипыТаблицДокументовОбмена/SUI_ТипыТаблицДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ТипыТаблицДокументовОбмена</name>
  <enumValues>
    <name>Отбор</name>
  </enumValues>
  <enumValues>
    <name>Размещение</name>
  </enumValues>
  <enumValues>
    <name>Товары</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыУпаковок</name>
  </enumValues>
  <enumValues>
    <name>ПотокШтрихкодов</name>
  </enumValues>
  <enumValues>
    <name>Серии</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/Catalogs/SUI_НастройкиДокументовОбмена/Forms/ФормаНастройкиРеквизитов/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ПредыдущийТипТаблицы;

&НаКлиенте
Перем ПредыдущееИмяТабличнойЧасти;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КлючСвязи = Параметры.КлючСвязи;
	УникальныйИдентификаторВладельца = Параметры.УникальныйИдентификаторВладельца;
	ИмяМетаданныхДокумента = Параметры.ИмяМетаданныхДокумента;
	ТипТаблицы = Параметры.ТипТаблицы;
	ИмяТабличнойЧасти = Параметры.ИмяТабличнойЧасти;
	
	Элементы.ГруппаТипТаблицыИмяТЧ.Видимость = ЗначениеЗаполнено(КлючСвязи);
	
	МетаданныеДокумента = Справочники.SUI_НастройкиДокументовОбмена.ПолучитьМетаданныеДокумента(ИмяМетаданныхДокумента);
	
	ОбщегоНазначенияКлиентСервер.Проверить(МетаданныеДокумента <> Неопределено,
		НСтр("ru = 'Не удалось инициализировать метаданные документа'"));
		
	Если Не ПустаяСтрока(ИмяТабличнойЧасти) И МетаданныеДокумента.ТабличныеЧасти.Найти(ИмяТабличнойЧасти) = Неопределено Тогда
		ИмяТабличнойЧасти = "";
		Модифицированность = Истина;
	КонецЕсли;
	
	// Это таблица
	Если ЗначениеЗаполнено(КлючСвязи) Тогда
		
		ЗагрузитьДоступныеТипыТаблицКВыбору(Параметры.НастроенныеТипыТаблиц.ВыгрузитьЗначения());
		
		Если ДоступныеТипыТаблицКВыбору.Количество() = 0 Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		ОписаниеРеквизитов = SUI_НастройкиДокументовПовтИсп.ОписаниеРеквизитовДокумента(ИмяМетаданныхДокумента)
			.Строки.Найти("ТабличныеЧасти", "Имя", Ложь);
			
		Для Каждого ОписаниеТабличнойЧасти Из ОписаниеРеквизитов.Строки Цикл
			Элементы.ИмяТабличнойЧасти.СписокВыбора.Добавить(ОписаниеТабличнойЧасти.Имя, ОписаниеТабличнойЧасти.Представление);
		КонецЦикла;
		
	КонецЕсли;
	
	ЗагрузитьОсновныеРеквизиты(НастройкиРеквизитов, ?(ЗначениеЗаполнено(КлючСвязи), ТипТаблицы, Неопределено));
	
	ИспользоватьДополнительныеРеквизиты = ПолучитьФункциональнуюОпцию("SUI_ИспользоватьДополнительныеРеквизитыТаблиц");
	
	Элементы.НастройкиРеквизитовДобавить.Видимость = ИспользоватьДополнительныеРеквизиты;
	Элементы.НастройкиРеквизитовКонтекстноеМенюДобавить.Видимость = ИспользоватьДополнительныеРеквизиты;
	Элементы.ГруппаНастройкиРеквизитов.ОтображениеПодсказки = 
		?(ИспользоватьДополнительныеРеквизиты, ОтображениеПодсказки.ОтображатьСнизу, ОтображениеПодсказки.Нет);
	
	ИнициализироватьСхемуКомпоновки();
	ИнициализироватьКомпоновщик(Параметры.АдресНастройкиРеквизитов);
	ЗагрузитьВыбранныеЗначения(ИспользоватьДополнительныеРеквизиты);
	ИнициализироватьСписокВыбораРеквизитов();
	
	Заголовок = Параметры.Заголовок;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(КлючСвязи) Тогда
		ДанныеНастройкиТаблицыПриИзменении();
	КонецЕсли;
	
	ПредыдущийТипТаблицы = ТипТаблицы;
	ПредыдущееИмяТабличнойЧасти = ИмяТабличнойЧасти;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	НеПроверяемыеРеквизиты = Новый Массив();
	
	Если Не ЗначениеЗаполнено(КлючСвязи) Тогда
		
		НеПроверяемыеРеквизиты.Добавить("ТипТаблицы");
		НеПроверяемыеРеквизиты.Добавить("ИмяТабличнойЧасти");
		
	КонецЕсли;
	
	Для Каждого ДанныеОбязательногоРеквизита Из НастройкиРеквизитов.НайтиСтроки(Новый Структура("Обязательный", Истина)) Цикл
		
		Если Не ЗначениеЗаполнено(ДанныеОбязательногоРеквизита.Поле) Тогда
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Не сопоставлено Поле для обязательного реквизита ""%1""'"), 
				ДанныеОбязательногоРеквизита.РеквизитПредставление);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "НастройкиРеквизитовПолеПредставление", , Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ДанныеНеОсновногоРеквизита Из НастройкиРеквизитов.НайтиСтроки(Новый Структура("Основной", Ложь)) Цикл
		
		Если Не ЗначениеЗаполнено(ДанныеНеОсновногоРеквизита.Реквизит) Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не заполнено имя дополнительного реквизита'"), , "НастройкиРеквизитовПредставлениеРеквизита", , Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НеПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Отказ Или ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		
		Отказ = Истина;
		
		Оповещение = Новый ОписаниеОповещения("ЗавершитьРедактированиеПодтверждениеСохранения", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Сохранить изменения?'"), РежимДиалогаВопрос.ДаНетОтмена);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипТаблицыПриИзменении(Элемент)
	
	ДанныеНастройкиТаблицыПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипТаблицыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ДоступныеТипыТаблицКВыбору;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяТабличнойЧастиПриИзменении(Элемент)
	
	ДанныеНастройкиТаблицыПриИзменении(Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройкиРеквизитов

&НаКлиенте
Процедура НастройкиРеквизитовПолеПредставлениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.Родитель.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элемент.Родитель.ТекущиеДанные.Поле = ВыбранноеЗначение.Поле;
	Элемент.Родитель.ТекущиеДанные.ПолеПредставление = ВыбранноеЗначение.ПолеПредставление;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРеквизитовПередУдалением(Элемент, Отказ)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные.Основной Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРеквизитовПредставлениеРеквизитаПриИзменении(Элемент)
	
	Если Элементы.НастройкиРеквизитов.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьНедопустимыеСимволыПоляНастройкиРеквизитов(Элементы.НастройкиРеквизитов.ТекущиеДанные.РеквизитПредставление);
	
	Элементы.НастройкиРеквизитов.ТекущиеДанные.Реквизит = Элементы.НастройкиРеквизитов.ТекущиеДанные.РеквизитПредставление;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РедактироватьНастройкиКомпоновки(Команда)
	
	Если Не КомпоновщикИнициализирован Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("РедактироватьНастройкиКомпоновкиЗавершение", ЭтотОбъект);
	
	ПараметрыОткрытияНастройкиОтбора = SUI_КомпоновкаДанныхКлиент.ПараметрыОткрытияНастройкиСхемыКомпоновкиДанных(
		ОповещениеОЗавершении, ЭтотОбъект);
	ПараметрыОткрытияНастройкиОтбора.Уникальность = УникальныйИдентификатор;
	ПараметрыОткрытияНастройкиОтбора.РежимОткрытия = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	
	ПараметрыНастройки = SUI_КомпоновкаДанныхКлиент.ПараметрыНастройкиСхемыКомпоновкиДанных(
		АдресСхемыКомпоновкиДанных, ПолучитьНастройкиИзКомпоновщика(КомпоновщикНастроек, УникальныйИдентификатор), УникальныйИдентификатор);
	ПараметрыНастройки.Заголовок 								= НСтр("ru = 'Редактирование доступных полей'");
	ПараметрыНастройки.НеРедактироватьСхемуКомпоновкиДанных 	= Истина;
	ПараметрыНастройки.НеЗагружатьСхемуКомпоновкиДанныхИзФайла 	= Истина;
	ПараметрыНастройки.НеПомещатьНастройкиВСхемуКомпоновкиДанных = Истина;
	ПараметрыНастройки.НеНастраиватьВыбор 						= Истина;
	ПараметрыНастройки.НеНастраиватьПараметры 					= Истина;
	ПараметрыНастройки.НеНастраиватьПорядок 					= Истина;
	ПараметрыНастройки.НеНастраиватьПользовательскиеПоля 		= Ложь;
	ПараметрыНастройки.НеНастраиватьОтбор						= Истина;
	
	SUI_КомпоновкаДанныхКлиент.ОткрытьНастройкиКомпоновкиДанных(ПараметрыОткрытияНастройкиОтбора, ПараметрыНастройки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ЗавершитьРедактированиеПодтверждениеСохранения", ЭтотОбъект);
	ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьСхемуКомпоновки()
	
	Схема = Неопределено;
	
	Если Не ПустаяСтрока(ИмяМетаданныхДокумента) И (
		Не ЗначениеЗаполнено(КлючСвязи) Или (ЗначениеЗаполнено(КлючСвязи) И Не ПустаяСтрока(ИмяТабличнойЧасти))) Тогда
		
		Если ЗначениеЗаполнено(КлючСвязи) И Не ПустаяСтрока(ИмяТабличнойЧасти) Тогда
			СтрокаКлючВыбора = ИмяТабличнойЧасти + ".*";
		ИначеЕсли Не ЗначениеЗаполнено(КлючСвязи) Тогда
			СтрокаКлючВыбора = СтрСоединить(SUI_НастройкиДокументовПовтИсп.ОписаниеРеквизитовДокумента(ИмяМетаданныхДокумента)
				.Строки.Найти("Реквизиты", "Имя", Ложь).Строки.ВыгрузитьКолонку("Имя"), ",");
		Иначе
			СтрокаКлючВыбора = "";
		КонецЕсли;
		
		Если Не ПустаяСтрока(СтрокаКлючВыбора) Тогда
			
			Схема = SUI_КомпоновкаДанныхСервер.ПустаяСхема();
			
			НаборДанных = SUI_КомпоновкаДанныхСервер.ДобавитьПустойНаборДанных(Схема);
			НаборДанных.Запрос = "ВЫБРАТЬ " + СтрокаКлючВыбора + " ИЗ Документ." + ИмяМетаданныхДокумента;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Схема = Неопределено И ЭтоАдресВременногоХранилища(АдресСхемыКомпоновкиДанных) Тогда
		УдалитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
		АдресСхемыКомпоновкиДанных = "";
	ИначеЕсли Схема <> Неопределено Тогда
		
		Если ЭтоАдресВременногоХранилища(АдресСхемыКомпоновкиДанных) Тогда
			АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(Схема, АдресСхемыКомпоновкиДанных);
		Иначе
			АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(Схема, УникальныйИдентификатор);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьКомпоновщик(АдресНастройки = Неопределено)
	
	Если ЭтоАдресВременногоХранилища(АдресСхемыКомпоновкиДанных) Тогда
		SUI_КомпоновкаДанныхСервер.ИнициализироватьКомпоновщикНастроек(КомпоновщикНастроек, АдресСхемыКомпоновкиДанных, АдресНастройки);
		КомпоновщикИнициализирован = Истина;
	Иначе
		КомпоновщикНастроек.Инициализировать(Неопределено);
		КомпоновщикИнициализирован = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНастройкиИзКомпоновщика(Компоновщик, Адрес)
	Возврат ПоместитьВоВременноеХранилище(Компоновщик.ПолучитьНастройки(), Адрес);
КонецФункции

&НаСервере
Процедура ИнициализироватьСписокВыбораРеквизитов()
	
	СтрокаПоискаЗаменыВЗаголовкеПоля = "";
	
	Элементы.НастройкиРеквизитовПолеПредставление.СписокВыбора.Очистить();
	
	Если Не ЗначениеЗаполнено(КлючСвязи) Тогда
		КоллекцияДоступныхПолейВыбора = КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы;
	ИначеЕсли ЗначениеЗаполнено(КлючСвязи) И Не ПустаяСтрока(ИмяТабличнойЧасти) Тогда
		
		КоллекцияДоступныхПолейВыбора = КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.НайтиПоле(Новый ПолеКомпоновкиДанных(ИмяТабличнойЧасти));
		
		Если КоллекцияДоступныхПолейВыбора <> Неопределено И КоллекцияДоступныхПолейВыбора.Папка Тогда
			СтрокаПоискаЗаменыВЗаголовкеПоля = КоллекцияДоступныхПолейВыбора.Заголовок + ".";
			КоллекцияДоступныхПолейВыбора = КоллекцияДоступныхПолейВыбора.Элементы;
		Иначе
			КоллекцияДоступныхПолейВыбора = Неопределено;
		КонецЕсли;
		
	Иначе
		КоллекцияДоступныхПолейВыбора = Неопределено;
	КонецЕсли;
	
	Если КоллекцияДоступныхПолейВыбора <> Неопределено Тогда
		
		Для Каждого ДоступноеПолеВыбора Из КоллекцияДоступныхПолейВыбора Цикл
			
			Если ДоступноеПолеВыбора.Папка Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не ПустаяСтрока(СтрокаПоискаЗаменыВЗаголовкеПоля) И СтрНачинаетсяС(ДоступноеПолеВыбора.Заголовок, СтрокаПоискаЗаменыВЗаголовкеПоля) Тогда
				ПолеПредставление = СтрЗаменить(ДоступноеПолеВыбора.Заголовок, СтрокаПоискаЗаменыВЗаголовкеПоля, "");
			Иначе
				ПолеПредставление = ДоступноеПолеВыбора.Заголовок;
			КонецЕсли;
			
			ЗначениеВыбора = Новый Структура();
			ЗначениеВыбора.Вставить("Поле", Строка(ДоступноеПолеВыбора.Поле));
			ЗначениеВыбора.Вставить("ПолеПредставление", ПолеПредставление);
			
			Элементы.НастройкиРеквизитовПолеПредставление.СписокВыбора.Добавить(ЗначениеВыбора, ПолеПредставление + " (" + ЗначениеВыбора.Поле + ")");
			
		КонецЦикла;
		
		КоллекцияПП = КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ПользовательскиеПоля"));
		Если КоллекцияПП <> Неопределено И КоллекцияПП.Папка Тогда
			
			Для Каждого ЭлементПП Из КоллекцияПП.Элементы Цикл
				
				Если ПустаяСтрока(ЭлементПП.Заголовок) Тогда
					Продолжить;
				КонецЕсли;
				
				ЗначениеВыбора = Новый Структура();
				ЗначениеВыбора.Вставить("Поле", Строка(ЭлементПП.Поле));
				ЗначениеВыбора.Вставить("ПолеПредставление", ЭлементПП.Заголовок);
				
				Элементы.НастройкиРеквизитовПолеПредставление.СписокВыбора.Добавить(ЗначениеВыбора, ЗначениеВыбора.ПолеПредставление);
				
			КонецЦикла;
			
		КонецЕсли;
		
		Элементы.НастройкиРеквизитовПолеПредставление.СписокВыбора.СортироватьПоЗначению();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗагрузитьОсновныеРеквизиты(НастройкиРеквизитов, ТипТаблицы)
	
	НастройкиРеквизитов.Очистить();
	
	ИменаОсновныхРеквизитовТаблиц = SUI_НастройкиДокументовКлиентСервер.ПолучитьИменаОсновныхРеквизитовТаблиц(
		(ТипТаблицы = Неопределено), ТипТаблицы);
	
	Для Каждого ОсновнойРеквизит Из ИменаОсновныхРеквизитовТаблиц Цикл
		
		СтрокаНастройкиРеквизитов = НастройкиРеквизитов.Добавить();
		СтрокаНастройкиРеквизитов.Реквизит = ОсновнойРеквизит.Значение;
		СтрокаНастройкиРеквизитов.РеквизитПредставление = ОсновнойРеквизит.Представление;
		СтрокаНастройкиРеквизитов.Обязательный = ОсновнойРеквизит.Пометка;
		СтрокаНастройкиРеквизитов.Основной = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьВыбранныеЗначения(ИспользоватьДополнительныеРеквизиты)
	
	Приемник = РеквизитФормыВЗначение("НастройкиРеквизитов", Тип("ТаблицаЗначений"));
	
	СистемныеПользовательскиеПоляКД = Новый Соответствие();
	Для Каждого Элемент Из КомпоновщикНастроек.Настройки.ПользовательскиеПоля.Элементы Цикл
		
		Если ПустаяСтрока(Элемент.Заголовок) И Элемент.Варианты.Элементы.Количество() = 1 Тогда
			СистемныеПользовательскиеПоляКД.Вставить(Элемент.ПутьКДанным, Строка(Элемент.Варианты.Элементы[0].Значение));
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ВыбранноеПоле Из КомпоновщикНастроек.Настройки.Выбор.Элементы Цикл
		
		Если ПустаяСтрока(ВыбранноеПоле.Заголовок) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаПриемник = Приемник.Найти(ВыбранноеПоле.Заголовок, "Реквизит");
		
		Если СтрокаПриемник = Неопределено Тогда
			
			Если ИспользоватьДополнительныеРеквизиты Тогда
				СтрокаПриемник = Приемник.Добавить();
			Иначе
				Модифицированность = Истина;
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		ПолеСтрокой = Строка(ВыбранноеПоле.Поле);
		
		Если Не ПустаяСтрока(ПолеСтрокой) Тогда
			
			ПолеСтрокой = SUI_ОбщегоНазначенияКлиентСервер.ЗначениеСоответствия(СистемныеПользовательскиеПоляКД, ПолеСтрокой, ПолеСтрокой);
			
			ДоступноеПоле = КомпоновщикНастроек.Настройки.Выбор.ДоступныеПоляВыбора.НайтиПоле(Новый ПолеКомпоновкиДанных(ПолеСтрокой));
			
			Если ДоступноеПоле <> Неопределено Тогда
				СтрокаПриемник.Поле = Строка(ДоступноеПоле.Поле);
				СтрокаПриемник.ПолеПредставление = ДоступноеПоле.Заголовок;
			КонецЕсли;
			
			Если Не СтрокаПриемник.Основной Тогда
				СтрокаПриемник.Реквизит = ВыбранноеПоле.Заголовок;
				УдалитьНедопустимыеСимволыПоляНастройкиРеквизитов(СтрокаПриемник.Реквизит);
				СтрокаПриемник.РеквизитПредставление = СтрокаПриемник.Реквизит;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПустаяСтрока(СтрокаПриемник.Реквизит) Тогда
			Приемник.Удалить(СтрокаПриемник);
		КонецЕсли;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Приемник, "НастройкиРеквизитов");
	
	Для Каждого Элемент Из СистемныеПользовательскиеПоляКД Цикл
		
		Для Каждого ЭлементПП Из КомпоновщикНастроек.Настройки.ПользовательскиеПоля.Элементы Цикл
			
			Если Элемент.Ключ = ЭлементПП.ПутьКДанным Тогда
				КомпоновщикНастроек.Настройки.ПользовательскиеПоля.Элементы.Удалить(ЭлементПП);
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьНедопустимыеСимволыПоляНастройкиРеквизитов(Поле)
	
	Результат = "";
	
	РазделителиСлов = SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.МассивЗначений(" ", ".", ",");
	
	ДопустимыеСимволы = SUI_СтроковыеФункцииКлиентСервер.АлфавитБуквыЛатинские()
		+ SUI_СтроковыеФункцииКлиентСервер.АлфавитБуквыРусские()
		+ SUI_СтроковыеФункцииКлиентСервер.АлфавитЦифры()
		+ "_";
	
	ДлинаСтроки = СтрДлина(Поле);
	СледующийСимволВВерхнемРегистре = Ложь;
	ПервыйСимвол = Истина;
	Для Индекс = 1 По ДлинаСтроки Цикл
		
		ПроверяемыйСимвол = Сред(Поле, Индекс, 1);
		
		Если РазделителиСлов.Найти(ПроверяемыйСимвол) <> Неопределено Тогда
			СледующийСимволВВерхнемРегистре = Истина;
			Продолжить;
		ИначеЕсли СтрНайти(ДопустимыеСимволы, ПроверяемыйСимвол) = 0 Тогда
			Продолжить;
		Иначе
			Результат = Результат + ?(СледующийСимволВВерхнемРегистре Или ПервыйСимвол, ВРег(ПроверяемыйСимвол), ПроверяемыйСимвол);
			СледующийСимволВВерхнемРегистре = Ложь;
			ПервыйСимвол = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Поле = Результат;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеНастройкиТаблицыПриИзменении(Элемент = Неопределено)
	
	Если Элемент <> Неопределено Тогда
		
		Если Элемент = Элементы.ТипТаблицы И ТипТаблицы <> ПредыдущийТипТаблицы Тогда
			ЗагрузитьОсновныеРеквизиты(НастройкиРеквизитов, ТипТаблицы);
			ПредыдущийТипТаблицы = ТипТаблицы;
		ИначеЕсли Элемент = Элементы.ИмяТабличнойЧасти И ИмяТабличнойЧасти <> ПредыдущееИмяТабличнойЧасти Тогда
			ИнициализироватьСхемуКомпоновки();
			ИнициализироватьКомпоновщик();
			ИнициализироватьСписокВыбораРеквизитов();
			ПредыдущееИмяТабличнойЧасти = ИмяТабличнойЧасти;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипТаблицы.Пустая() Тогда
		ИмяТабличнойЧасти = "";
		Элементы.ИмяТабличнойЧасти.Доступность = Ложь;
	Иначе
		Элементы.ИмяТабличнойЧасти.Доступность = Истина;
	КонецЕсли;
	
	Если ПустаяСтрока(ИмяТабличнойЧасти) Тогда
		Элементы.НастройкиРеквизитов.Доступность = Ложь;
	Иначе
		Элементы.НастройкиРеквизитов.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДоступныеТипыТаблицКВыбору(НастроенныеТипыТаблиц)
	
	ДоступныеТипыТаблиц = Новый Массив();
	
	Для Каждого ПараметрОтбораТипаТаблицы Из Элементы.ТипТаблицы.ПараметрыВыбора Цикл
		
		Если ПараметрОтбораТипаТаблицы.Имя = "Отбор.Ссылка" Тогда
			
			ОписаниеТипаФиксированныйМассив = Новый ОписаниеТипов("ФиксированныйМассив");
			Для Каждого ТипТаблицыОтбора Из ОписаниеТипаФиксированныйМассив.ПривестиЗначение(ПараметрОтбораТипаТаблицы.Значение) Цикл
				ДоступныеТипыТаблиц.Добавить(ТипТаблицыОтбора);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ТипТаблицы.Пустая() И ДоступныеТипыТаблиц.Найти(ТипТаблицы) = Неопределено Тогда
		ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.ПустаяСсылка();
		Модифицированность = Истина;
	КонецЕсли;
	
	ИсключаемыеТипыТаблиц = Новый Массив();
	
	Если НастроенныеТипыТаблиц.Найти(Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары) <> Неопределено Тогда
		ИсключаемыеТипыТаблиц.Добавить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор);
		ИсключаемыеТипыТаблиц.Добавить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение);
	ИначеЕсли НастроенныеТипыТаблиц.Найти(Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор) <> Неопределено Тогда
		ИсключаемыеТипыТаблиц.Добавить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары);
		ИсключаемыеТипыТаблиц.Добавить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение);
	ИначеЕсли НастроенныеТипыТаблиц.Найти(Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение) <> Неопределено Тогда
		ИсключаемыеТипыТаблиц.Добавить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары);
		ИсключаемыеТипыТаблиц.Добавить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор);
	КонецЕсли;
	
	ДоступныеТипыТаблиц = ОбщегоНазначенияКлиентСервер.РазностьМассивов(ДоступныеТипыТаблиц, НастроенныеТипыТаблиц);
	ДоступныеТипыТаблиц = ОбщегоНазначенияКлиентСервер.РазностьМассивов(ДоступныеТипыТаблиц, ИсключаемыеТипыТаблиц);
	
	Если Не ТипТаблицы.Пустая() И ДоступныеТипыТаблиц.Найти(ТипТаблицы) = Неопределено Тогда
		ДоступныеТипыТаблиц.Добавить(ТипТаблицы);
	КонецЕсли;
	
	ДоступныеТипыТаблицКВыбору.ЗагрузитьЗначения(ОбщегоНазначенияКлиентСервер.СвернутьМассив(ДоступныеТипыТаблиц));
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьНастройкиКомпоновкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ИнициализироватьКомпоновщик(Результат);
		ИнициализироватьСписокВыбораРеквизитов();
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРедактированиеПодтверждениеСохранения(Подтверждение, ДополнительныеПараметры) Экспорт
	
	Если Подтверждение = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	Иначе
		ЗавершитьНастройкуИЗакрыть(Подтверждение = КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьНастройкуИЗакрыть(СРезультатом = Истина)
	
	Результат = Неопределено;
	
	Если СРезультатом Тогда
		
		Если ПроверитьЗаполнение() Тогда
			Результат = СформироватьРезультатНастройки();
		Иначе
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Модифицированность = Ложь;
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Функция СформироватьРезультатНастройки()
	
	Результат = Новый Структура();
	
	Результат.Вставить("КлючСвязи", 				КлючСвязи);
	Результат.Вставить("ИмяМетаданныхДокумента", 	ИмяМетаданныхДокумента);
	Результат.Вставить("ТипТаблицы", 				ТипТаблицы);
	Результат.Вставить("ИмяТабличнойЧасти", 		ИмяТабличнойЧасти);
	Результат.Вставить("АдресНастройкиРеквизитов", 	"");
	
	Если КомпоновщикИнициализирован Тогда
		ДополнитьРезультатНастройкиНаСервере(Результат);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ДополнитьРезультатНастройкиНаСервере(Результат)
	
	КомпоновщикНастроек.Настройки.Выбор.Элементы.Очистить();
	
	Для Каждого СтрокаНастройки Из НастройкиРеквизитов Цикл
		
		Если ПустаяСтрока(СтрокаНастройки.Реквизит) Или ПустаяСтрока(СтрокаНастройки.Поле) Тогда
			Продолжить;
		КонецЕсли;
		
		SUI_КомпоновкаДанныхКлиентСервер.ДобавитьВыбранноеПоле(КомпоновщикНастроек, СтрокаНастройки.Поле, СтрокаНастройки.Реквизит);
		
	КонецЦикла;
	
	Результат.АдресНастройкиРеквизитов = ПоместитьВоВременноеХранилище(КомпоновщикНастроек.ПолучитьНастройки(), УникальныйИдентификаторВладельца);
	
КонецПроцедуры

#КонецОбласти
